{
  "state": "enabled",
  "displayName": "CA003-Global-AttackSurfaceReduction-AllApps-AnyPlatform-BlockGeoIP",
  "grantControls": {
    "operator": "OR",
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('e125166c-6303-4bf7-aef6-1a81b0cf4f22')/grantControls/authenticationStrength/$entity",
    "termsOfUse": [],
    "customAuthenticationFactors": [],
    "authenticationStrength": null,
    "builtInControls": [
      "block"
    ]
  },
  "sessionControls": null,
  "conditions": {
    "platforms": null,
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": null,
    "devices": null,
    "locations": {
      "includeLocations": [
        "1cc46ea8-2d4c-460f-99e4-05514e70bea1"
      ],
      "excludeLocations": []
    },
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "e9378db0-32a2-4441-9e40-007f7c8388c8"
      ],
      "excludeRoles": [],
      "includeUsers": [
        "All"
      ],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": []
  }
}
