{
  "Conditions": {
    "Applications": {
      "ExcludeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ],
      "IncludeApplications": [
        "All"
      ],
      "IncludeAuthenticationContextClassReferences": [],
      "IncludeUserActions": []
    },
    "ClientAppTypes": [
      "all"
    ],
    "ClientApplications": {
      "ExcludeServicePrincipals": null,
      "IncludeServicePrincipals": null
    },
    "Devices": {
      "DeviceFilter": {
        "Mode": null,
        "Rule": null
      }
    },
    "Locations": {
      "ExcludeLocations": null,
      "IncludeLocations": null
    },
    "Platforms": {
      "ExcludePlatforms": [
        "android",
        "iOS",
        "macOS",
        "linux"
      ],
      "IncludePlatforms": [
        "all"
      ]
    },
    "ServicePrincipalRiskLevels": [],
    "SignInRiskLevels": [],
    "UserRiskLevels": [],
    "Users": {
      "ExcludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "b819bd82-fc60-418e-b199-5a3cbf96a6dd"
      ],
      "ExcludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "ExcludeRoles": [],
      "ExcludeUsers": [],
      "IncludeGroups": [
        "b86af40e-e4f0-4e83-a2bb-ef5321269384"
      ],
      "IncludeGuestsOrExternalUsers": {
        "ExternalTenants": {
          "MembershipKind": null
        },
        "GuestOrExternalUserTypes": null
      },
      "IncludeRoles": [],
      "IncludeUsers": []
    }
  },
  "CreatedDateTime": "2023-07-05T10:49:54.2526601Z",
  "Description": null,
  "DisplayName": "CA200-Internals-BaseProtection-AllApps-AnyPlatform-CompliantorAADHJ",
  "GrantControls": {
    "AuthenticationStrength": {
      "AllowedCombinations": null,
      "CombinationConfigurations": null,
      "CreatedDateTime": null,
      "Description": null,
      "DisplayName": null,
      "Id": null,
      "ModifiedDateTime": null,
      "PolicyType": null,
      "RequirementsSatisfied": null
    },
    "BuiltInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "CustomAuthenticationFactors": [],
    "Operator": "OR",
    "TermsOfUse": []
  },
  "Id": "ac910a44-be6c-4260-b56a-fb5883c90086",
  "ModifiedDateTime": "2023-07-06T14:15:23.1669681Z",
  "SessionControls": {
    "ApplicationEnforcedRestrictions": {
      "IsEnabled": null
    },
    "CloudAppSecurity": {
      "CloudAppSecurityType": null,
      "IsEnabled": null
    },
    "DisableResilienceDefaults": null,
    "PersistentBrowser": {
      "IsEnabled": null,
      "Mode": null
    },
    "SignInFrequency": {
      "AuthenticationType": null,
      "FrequencyInterval": null,
      "IsEnabled": null,
      "Type": null,
      "Value": null
    }
  },
  "State": "enabled",
  "AdditionalProperties": {}
}
