{
  "sessionControls": null,
  "state": "enabledForReportingButNotEnforced",
  "displayName": "CA100-Admins-BaseProtection-AllApps-AnyPlatform-CompliantorAADHJ",
  "conditions": {
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ]
    },
    "locations": null,
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "platforms": null,
    "devices": null,
    "users": {
      "includeRoles": [],
      "includeUsers": [],
      "excludeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "ff9425a4-9987-4f55-a560-2d214e7e234e",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "e2db5803-40c0-409f-a5a6-a785450669d3"
      ],
      "excludeUsers": [],
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null
    },
    "clientAppTypes": [
      "all"
    ]
  },
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('350da22d-0f89-4ce6-b046-884840509f3d')/grantControls/authenticationStrength/$entity",
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "authenticationStrength": null,
    "operator": "OR"
  }
}
