{
  "sessionControls": null,
  "state": "enabled",
  "displayName": "CA202-Internals-IdentityProtection-AllApps-AnyPlatform-MFAandPWDforHighUserRisk",
  "conditions": {
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    },
    "locations": null,
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "signInRiskLevels": [],
    "userRiskLevels": [
      "high"
    ],
    "platforms": null,
    "devices": null,
    "users": {
      "includeRoles": [],
      "includeUsers": [],
      "excludeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "8278775b-63f6-4e47-be83-e6a312f0e80b"
      ],
      "excludeUsers": [],
      "includeGroups": [
        "b86af40e-e4f0-4e83-a2bb-ef5321269384"
      ],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null
    },
    "clientAppTypes": [
      "all"
    ]
  },
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('07c196a3-8707-4903-9b2f-df9e4f64e969')/grantControls/authenticationStrength/$entity",
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "builtInControls": [
      "mfa",
      "passwordChange"
    ],
    "authenticationStrength": null,
    "operator": "AND"
  }
}
