{
  "sessionControls": null,
  "displayName": "CA102-Admins-IdentityProtection-AllApps-AnyPlatform-CombinedRegistration",
  "grantControls": {
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('1ccadad2-b2fd-450c-ac8e-86c5be3110d5')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "ff9425a4-9987-4f55-a560-2d214e7e234e",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "ecbc091e-bcb5-4f56-859d-e3d4ea9771ef"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [],
      "includeUserActions": [
        "urn:user:registersecurityinfo"
      ],
      "excludeApplications": []
    }
  }
}
