{
  "sessionControls": null,
  "displayName": "CA205-Internals-AppProtection-MicrosoftIntuneEnrollment-AnyPlatform-MFA",
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('973ec987-1590-425e-a163-4837bbde9eda')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "b86af40e-e4f0-4e83-a2bb-ef5321269384"
      ],
      "excludeGroups": [],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
