{
  "sessionControls": null,
  "displayName": "CA002-Global-AttackSurfaceReduction-VariousApps-AnyPlatform-Block",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('fcd6d631-dcdc-4c64-88f3-2f3a84d0cfd1')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabled",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "08f54e3a-0be4-498a-9047-921c7f60f84c"
      ],
      "includeUsers": [
        "All"
      ],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "00000005-0000-0ff1-ce00-000000000000",
        "905fcf26-4eb7-48a0-9ff0-8dcc7194b5ba"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
