{
  "sessionControls": null,
  "displayName": "CA003-Global-AttackSurfaceReduction-AllApps-AnyPlatform-BlockGeoIP",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('e125166c-6303-4bf7-aef6-1a81b0cf4f22')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabled",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "08f54e3a-0be4-498a-9047-921c7f60f84c"
      ],
      "includeUsers": [
        "All"
      ],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": {
      "includeLocations": [
        "1cc46ea8-2d4c-460f-99e4-05514e70bea1"
      ],
      "excludeLocations": []
    },
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
