{
  "sessionControls": null,
  "displayName": "CA101-Admins-BaseProtection-AllApps-AnyPlatform-MFA",
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('f73e18ee-167e-4754-b6b4-ce045b72f001')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "a67e45ea-3341-453a-86ba-f0a204fb48d7"
      ],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "193ede77-7fea-4043-b020-d09dd9e163f3",
        "52a650ed-fff1-413c-9787-63bad66c87a9",
        "17635f2a-3885-441b-98da-faef755d27fe",
        "16bc6fd7-dc74-4d0c-a9d3-ffe679416e12"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
