{
  "displayName": "CA108-Admins-DataProtection-AllApps-AnyPlatform-SessionPolicy",
  "grantControls": null,
  "state": "enabledForReportingButNotEnforced",
  "sessionControls": {
    "applicationEnforcedRestrictions": null,
    "signInFrequency": {
      "frequencyInterval": "timeBased",
      "isEnabled": true,
      "value": 4,
      "authenticationType": "primaryAndSecondaryAuthentication",
      "type": "hours"
    },
    "cloudAppSecurity": null,
    "disableResilienceDefaults": null,
    "persistentBrowser": {
      "mode": "never",
      "isEnabled": true
    }
  },
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "a67e45ea-3341-453a-86ba-f0a204fb48d7"
      ],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "193ede77-7fea-4043-b020-d09dd9e163f3",
        "52a650ed-fff1-413c-9787-63bad66c87a9",
        "17635f2a-3885-441b-98da-faef755d27fe",
        "cf19de65-2e62-498e-9330-3da5cd56bc19"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
