{
  "sessionControls": null,
  "displayName": "CA105-Admins-IdentityProtection-AllApps-AnyPlatform-BlockLegacyAuth",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('764f4ab9-018f-4d52-b923-49dd4b2c76ac')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "exchangeActiveSync",
      "other"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "a67e45ea-3341-453a-86ba-f0a204fb48d7"
      ],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "d02030d0-e9da-4427-be00-d2481e903083"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
