{
  "sessionControls": null,
  "displayName": "CA109-Admins-AttackSurfaceReduction-AllApps-AnyPlatform-BlockUnknownPlatforms",
  "grantControls": {
    "builtInControls": [
      "block"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('268a1fc2-e9d7-4a8a-ad9b-0e0b686dea41')/grantControls/authenticationStrength/$entity"
  },
  "state": "disabled",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "a67e45ea-3341-453a-86ba-f0a204fb48d7"
      ],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "193ede77-7fea-4043-b020-d09dd9e163f3",
        "52a650ed-fff1-413c-9787-63bad66c87a9",
        "17635f2a-3885-441b-98da-faef755d27fe",
        "6b7bcca7-5aad-48a2-a3c4-703716c61943"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "platforms": {
      "includePlatforms": [
        "all"
      ],
      "excludePlatforms": [
        "android",
        "iOS",
        "windows",
        "macOS"
      ]
    },
    "devices": null,
    "locations": null,
    "clientApplications": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": []
    }
  }
}
