{
  "state": "disabled",
  "displayName": "CA109-Admins-AttackSurfaceReduction-AllApps-AnyPlatform-BlockUnknownPlatforms",
  "grantControls": {
    "operator": "OR",
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('268a1fc2-e9d7-4a8a-ad9b-0e0b686dea41')/grantControls/authenticationStrength/$entity",
    "termsOfUse": [],
    "customAuthenticationFactors": [],
    "authenticationStrength": null,
    "builtInControls": [
      "block"
    ]
  },
  "sessionControls": null,
  "conditions": {
    "platforms": {
      "excludePlatforms": [
        "android",
        "iOS",
        "windows",
        "macOS"
      ],
      "includePlatforms": [
        "all"
      ]
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "ff9425a4-9987-4f55-a560-2d214e7e234e",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "b28d508d-4dc1-4fca-ab2f-4dafd2073ed1"
      ],
      "excludeRoles": [],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "includeRoles": [],
      "includeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": []
  }
}
