{
  "sessionControls": null,
  "displayName": "CA201-Internals-IdentityProtection-AllApps-AnyPlatform-CombinedRegistration",
  "grantControls": {
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('3648147b-d817-463b-8cfc-208f24140056')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabled",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "d40018a4-8ab5-4391-90d1-272851da605b"
      ],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "ae1b3493-6287-4f9c-8474-f75b02ac7215"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [],
      "includeUserActions": [
        "urn:user:registersecurityinfo"
      ],
      "excludeApplications": []
    }
  }
}
