{
  "sessionControls": null,
  "displayName": "CA200-Internals-BaseProtection-AllApps-AnyPlatform-CompliantorAADHJ",
  "grantControls": {
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "authenticationStrength": null,
    "termsOfUse": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('ac910a44-be6c-4260-b56a-fb5883c90086')/grantControls/authenticationStrength/$entity"
  },
  "state": "enabled",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": [],
      "includeRoles": [],
      "includeGroups": [
        "d40018a4-8ab5-4391-90d1-272851da605b"
      ],
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "c228a979-bbd7-4aef-b03d-de4193bd0145"
      ],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "platforms": null,
    "signInRiskLevels": [],
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "excludeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ]
    }
  }
}
