{
  "state": "enabled",
  "displayName": "CA200-Internals-BaseProtection-AllApps-AnyPlatform-CompliantorAADHJ",
  "grantControls": {
    "operator": "OR",
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('ac910a44-be6c-4260-b56a-fb5883c90086')/grantControls/authenticationStrength/$entity",
    "termsOfUse": [],
    "customAuthenticationFactors": [],
    "authenticationStrength": null,
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ]
  },
  "sessionControls": null,
  "conditions": {
    "platforms": null,
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "applications": {
      "excludeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "b819bd82-fc60-418e-b199-5a3cbf96a6dd"
      ],
      "excludeRoles": [],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeGroups": [
        "b86af40e-e4f0-4e83-a2bb-ef5321269384"
      ],
      "includeRoles": [],
      "includeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": []
  }
}
