{
  "state": "enabled",
  "displayName": "CA105-Admins-IdentityProtection-AllApps-AnyPlatform-BlockLegacyAuth",
  "grantControls": {
    "operator": "OR",
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('ac5e95bb-e278-430e-9da5-3aaa3c5b3eab')/grantControls/authenticationStrength/$entity",
    "termsOfUse": [],
    "customAuthenticationFactors": [],
    "authenticationStrength": null,
    "builtInControls": [
      "block"
    ]
  },
  "sessionControls": null,
  "conditions": {
    "platforms": null,
    "clientAppTypes": [
      "exchangeActiveSync",
      "other"
    ],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "All"
      ],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "excludeGroups": [
        "daac7a30-aa53-4bc3-aede-33d35ffb860f",
        "d02030d0-e9da-4427-be00-d2481e903083"
      ],
      "excludeRoles": [],
      "includeUsers": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeGroups": [
        "a67e45ea-3341-453a-86ba-f0a204fb48d7"
      ],
      "includeRoles": [],
      "includeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": []
  }
}
