{
  "state": "disabled",
  "displayName": "Office 365 App Control",
  "grantControls": null,
  "sessionControls": {
    "applicationEnforcedRestrictions": null,
    "persistentBrowser": null,
    "signInFrequency": null,
    "disableResilienceDefaults": null,
    "cloudAppSecurity": {
      "cloudAppSecurityType": "mcasConfigured",
      "isEnabled": true
    }
  },
  "conditions": {
    "platforms": null,
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "clientApplications": null,
    "devices": null,
    "locations": null,
    "applications": {
      "excludeApplications": [],
      "includeApplications": [
        "00000002-0000-0ff1-ce00-000000000000",
        "00000003-0000-0ff1-ce00-000000000000"
      ],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "excludeGroups": [],
      "excludeRoles": [],
      "includeUsers": [
        "All"
      ],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeGuestsOrExternalUsers": null
    },
    "userRiskLevels": [],
    "servicePrincipalRiskLevels": [],
    "signInRiskLevels": []
  }
}
