{
  "conditions": {
    "userRiskLevels": [],
    "devices": null,
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeUserActions": [],
      "applicationFilter": null,
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": {
        "guestOrExternalUserTypes": "b2bCollaborationGuest,serviceProvider",
        "externalTenants": {
          "membershipKind": "all",
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants"
        }
      },
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [],
      "includeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "b86af40e-e4f0-4e83-a2bb-ef5321269384",
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed",
        "2a5e5a3b-43a6-46cd-aa10-c8900531e609",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "40faab60-cf39-4f9d-a890-bdd59622c497",
        "ff9425a4-9987-4f55-a560-2d214e7e234e",
        "e9378db0-32a2-4441-9e40-007f7c8388c8"
      ],
      "includeUsers": [
        "All"
      ]
    },
    "locations": null,
    "platforms": null
  },
  "state": "enabled",
  "grantControls": {
    "authenticationStrength": null,
    "termsOfUse": [],
    "builtInControls": [
      "block"
    ],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('4c66cf27-5a3e-48a8-8435-b113bdac0313')/grantControls/authenticationStrength/$entity"
  },
  "displayName": "CA001-Global-BaseProtection-AllApps-AnyPlatform-BlockNonPersonas",
  "sessionControls": null
}
