{
  "state": "enabled",
  "conditions": {
    "userRiskLevels": [],
    "devices": {
      "deviceFilter": {
        "rule": "device.extensionAttribute1 -eq \"CONTOSO-IT\"",
        "mode": "exclude"
      }
    },
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeUserActions": [],
      "applicationFilter": null,
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "includeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "14ee818d-85f3-4227-ad53-fab87b5787c7"
      ],
      "includeUsers": []
    },
    "locations": null,
    "platforms": null
  },
  "grantControls": null,
  "displayName": "CA108-Admins-DataProtection-AllApps-AnyPlatform-SessionPolicy",
  "sessionControls": {
    "signInFrequency": {
      "frequencyInterval": "timeBased",
      "authenticationType": "primaryAndSecondaryAuthentication",
      "value": 1,
      "isEnabled": true,
      "type": "hours"
    },
    "persistentBrowser": {
      "mode": "never",
      "isEnabled": true
    },
    "disableResilienceDefaults": null,
    "cloudAppSecurity": null,
    "applicationEnforcedRestrictions": null
  }
}
