{
  "conditions": {
    "userRiskLevels": [],
    "devices": null,
    "platforms": {
      "includePlatforms": [
        "all"
      ],
      "excludePlatforms": [
        "windows"
      ]
    },
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeUserActions": [],
      "applicationFilter": null,
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "locations": null,
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "includeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "14ee818d-85f3-4227-ad53-fab87b5787c7"
      ],
      "includeUsers": []
    }
  },
  "state": "enabled",
  "grantControls": {
    "authenticationStrength": null,
    "termsOfUse": [],
    "builtInControls": [
      "block"
    ],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('268a1fc2-e9d7-4a8a-ad9b-0e0b686dea41')/grantControls/authenticationStrength/$entity"
  },
  "displayName": "CA109-Admins-AttackSurfaceReduction-AllApps-AnyPlatform-BlockUnwantedPlatforms",
  "sessionControls": null
}
