{
  "conditions": {
    "userRiskLevels": [],
    "devices": null,
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeUserActions": [
        "urn:user:registersecurityinfo"
      ],
      "applicationFilter": null,
      "includeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": {
        "guestOrExternalUserTypes": "b2bCollaborationGuest,serviceProvider",
        "externalTenants": {
          "membershipKind": "all",
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants"
        }
      },
      "includeGroups": [],
      "includeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "12f31775-9375-4003-8e66-3052e972f99d"
      ],
      "includeUsers": []
    },
    "locations": null,
    "platforms": null
  },
  "state": "enabled",
  "grantControls": {
    "authenticationStrength": null,
    "termsOfUse": [
      "0272f2a4-dba2-4135-8197-563b3a420d34"
    ],
    "builtInControls": [],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('836e40e0-e396-4dc2-8462-85f40915ad6f')/grantControls/authenticationStrength/$entity"
  },
  "displayName": "CA401-Guests-IdentityProtection-AllApps-AnyPlatform-TOU-CombinedRegistration",
  "sessionControls": null
}
