{
  "state": "enabled",
  "conditions": {
    "userRiskLevels": [],
    "devices": null,
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeUserActions": [],
      "applicationFilter": null,
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [
        "40faab60-cf39-4f9d-a890-bdd59622c497"
      ],
      "includeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "9e807e2b-d4bc-4486-801e-5a5d0228dd5c"
      ],
      "includeUsers": []
    },
    "locations": null,
    "platforms": null
  },
  "grantControls": null,
  "displayName": "CA506-GuestAdmins-DataProtection-AllApps-AnyPlatform-SessionPolicy",
  "sessionControls": {
    "signInFrequency": {
      "frequencyInterval": "timeBased",
      "authenticationType": "primaryAndSecondaryAuthentication",
      "value": 4,
      "isEnabled": true,
      "type": "hours"
    },
    "persistentBrowser": {
      "mode": "never",
      "isEnabled": true
    },
    "disableResilienceDefaults": null,
    "cloudAppSecurity": null,
    "applicationEnforcedRestrictions": null
  }
}
