{
  "conditions": {
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "userRiskLevels": [],
    "devices": null,
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [
        "3ac3875d-8457-422b-9097-8b76ae7bf75c"
      ],
      "includeRoles": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "cd29b75b-8b25-4374-a46d-fc745e522dee"
      ],
      "includeUsers": []
    },
    "applications": {
      "includeUserActions": [],
      "applicationFilter": null,
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "platforms": null
  },
  "state": "enabled",
  "grantControls": {
    "authenticationStrength": null,
    "termsOfUse": [],
    "builtInControls": [
      "block"
    ],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('09fa47ef-46de-4749-8788-9edb12634877')/grantControls/authenticationStrength/$entity"
  },
  "displayName": "CA700-AzureServiceAccounts-BaseProtection-AllApps-AnyPlatform-BlockUntrustedLocations",
  "sessionControls": null
}
