{
  "conditions": {
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "userRiskLevels": [],
    "devices": null,
    "clientAppTypes": [
      "all"
    ],
    "signInRiskLevels": [],
    "clientApplications": null,
    "servicePrincipalRiskLevels": [],
    "users": {
      "excludeUsers": [],
      "excludeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [],
      "includeRoles": [],
      "excludeGroups": [],
      "includeUsers": [
        "None"
      ]
    },
    "applications": {
      "includeUserActions": [],
      "applicationFilter": null,
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": [],
      "excludeApplications": []
    },
    "platforms": null
  },
  "state": "disabled",
  "grantControls": {
    "authenticationStrength": null,
    "termsOfUse": [],
    "builtInControls": [
      "block"
    ],
    "operator": "OR",
    "customAuthenticationFactors": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('4e6c5b80-e8be-4eb3-9047-a8ff1541999f')/grantControls/authenticationStrength/$entity"
  },
  "displayName": "CA900-WorkloadIdentities-BaseProtection-AllApps-AnyPlatform-BlockUntrustedLocations",
  "sessionControls": null
}
