{
  "sessionControls": null,
  "state": "enabled",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ],
      "includeApplications": [],
      "excludeApplications": []
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "e9378db0-32a2-4441-9e40-007f7c8388c8"
      ]
    },
    "clientApplications": null,
    "locations": {
      "includeLocations": [
        "All"
      ],
      "excludeLocations": [
        "0f0dcced-3f76-43f7-bc4f-2bcca0ef1d45"
      ]
    },
    "platforms": null
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('c35097df-112a-4ba9-9e86-8759dd7561f1')/grantControls/authenticationStrength/$entity",
    "operator": "OR",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA004-Global-BaseProtection-AllApps-AnyPlatform-MFAforDeviceRegistration"
}
