{
  "sessionControls": null,
  "state": "disabled",
  "conditions": {
    "userRiskLevels": [
      "high",
      "medium"
    ],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": []
    },
    "users": {
      "includeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "ff9425a4-9987-4f55-a560-2d214e7e234e",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "ecbc091e-bcb5-4f56-859d-e3d4ea9771ef"
      ]
    },
    "clientApplications": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "builtInControls": [
      "mfa",
      "passwordChange"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('12db2765-2970-4c34-9a21-0aebbce324e4')/grantControls/authenticationStrength/$entity",
    "operator": "AND",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA103-Admins-IdentityProtection-AllApps-AnyPlatform-MFAandPWDforMediumandHighUserRisk"
}
