{
  "sessionControls": null,
  "state": "disabled",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ]
    },
    "users": {
      "includeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "849ca128-f84e-437e-8efd-4b4c3ddfd0d2",
        "14ee818d-85f3-4227-ad53-fab87b5787c7",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "ff9425a4-9987-4f55-a560-2d214e7e234e"
      ]
    },
    "clientApplications": null,
    "locations": null,
    "platforms": {
      "includePlatforms": [
        "android",
        "iOS"
      ],
      "excludePlatforms": []
    }
  },
  "grantControls": {
    "builtInControls": [
      "compliantApplication"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('b8dd4789-59bc-444a-ac49-2e701034c0cc')/grantControls/authenticationStrength/$entity",
    "operator": "OR",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA107-Admins-DataandAppProtection-AllApps-iOSorAndroid-ClientAppandAPP"
}
