{
  "sessionControls": null,
  "state": "enabled",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "d4ebce55-015a-49b5-a083-c84d1797ae8c"
      ],
      "excludeApplications": []
    },
    "users": {
      "includeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [
        "2bda5037-6b74-4892-b5ab-5b8b1c20cfed"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "849ca128-f84e-437e-8efd-4b4c3ddfd0d2",
        "3ac3875d-8457-422b-9097-8b76ae7bf75c",
        "af2ce85a-5d4e-4f7e-a04b-468cd6a29699",
        "ff9425a4-9987-4f55-a560-2d214e7e234e"
      ]
    },
    "clientApplications": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('23be8351-7520-4c7d-b3b2-d51e59570cea')/grantControls/authenticationStrength/$entity",
    "operator": "OR",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA106-Admins-AppProtection-MicrosoftIntuneEnrollment-AnyPlatform-MFA"
}
