{
  "sessionControls": null,
  "state": "disabled",
  "conditions": {
    "userRiskLevels": [
      "high"
    ],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": []
    },
    "users": {
      "includeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [
        "b86af40e-e4f0-4e83-a2bb-ef5321269384"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "8278775b-63f6-4e47-be83-e6a312f0e80b"
      ]
    },
    "clientApplications": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "builtInControls": [
      "mfa",
      "passwordChange"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('07c196a3-8707-4903-9b2f-df9e4f64e969')/grantControls/authenticationStrength/$entity",
    "operator": "AND",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA202-Internals-IdentityProtection-AllApps-AnyPlatform-MFAandPWDforHighUserRisk"
}
