{
  "sessionControls": null,
  "state": "enabled",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [
        "urn:user:registersecurityinfo"
      ],
      "includeApplications": [],
      "excludeApplications": []
    },
    "users": {
      "includeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [
        "b86af40e-e4f0-4e83-a2bb-ef5321269384"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "8278775b-63f6-4e47-be83-e6a312f0e80b"
      ]
    },
    "clientApplications": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('3648147b-d817-463b-8cfc-208f24140056')/grantControls/authenticationStrength/$entity",
    "operator": "OR",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA201-Internals-IdentityProtection-AllApps-AnyPlatform-CombinedRegistration"
}
