{
  "sessionControls": null,
  "state": "enabled",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "devices": null,
    "applications": {
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": []
    },
    "users": {
      "includeUsers": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGroups": [
        "40faab60-cf39-4f9d-a890-bdd59622c497"
      ],
      "excludeGroups": [
        "ee2bdc01-80c2-4e28-9882-858bcfa005bf",
        "e7fae4ca-25ac-4d7f-9d48-ded903718762"
      ]
    },
    "clientApplications": null,
    "locations": null,
    "platforms": null
  },
  "grantControls": {
    "builtInControls": [
      "mfa"
    ],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('ed67d6b3-4788-4f50-94b2-c00e08cc3f95')/grantControls/authenticationStrength/$entity",
    "operator": "OR",
    "authenticationStrength": null,
    "customAuthenticationFactors": []
  },
  "displayName": "CA500-GuestAdmins-BaseProtection-AllApps-AnyPlatform-MFA"
}
